In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'AAA':[4,5,6,7],'BBB':[10,20,30,40],'CCC':[100,50,-30,-50]})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [4]:
df.loc[(df.AAA <= 6) & (df.index.isin([0,2,4])),df.loc[0]>8] # 前面筛选行, 后面筛选列

   BBB  CCC
0   10  100
2   30  -30

## loc & iloc

In [7]:
data={'AAA':[4,5,6,7],'BBB':[10,20,30,40],'CCC':[100,50,-30,-50]}

In [9]:
df = pd.DataFrame(data=data,index=['one','two','three','four'])
df

       AAA  BBB  CCC
one      4   10  100
two      5   20   50
three    6   30  -30
four     7   40  -50

In [10]:
df.loc['two':'three']

       AAA  BBB  CCC
two      5   20   50
three    6   30  -30

#### loc iloc 取值 --> loc 闭区间   iloc开区间

In [12]:
df2 = pd.DataFrame(data=data,index=[1,2,3,4])
df2

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30
4    7   40  -50

In [13]:
df2.loc[1:3]

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [14]:
df2.iloc[1:3]

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

### 取反

In [19]:
df = pd.DataFrame({'AAA':[4,5,6,7],'BBB':[10,20,30,40],'CCC':[100,50,-30,-50]})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [26]:
df.loc[df.AAA>5 & df.index.isin([0,1,2])]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [29]:
df.loc[~((df.AAA>5) & (df.index.isin([0,1,2])))]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
3    7   40  -50

## new Cloumns

In [31]:
df = pd.DataFrame({'AAA' : [1,2,1,3], 'BBB' : [1,1,2,2], 'CCC' : [2,1,3,1]})
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [34]:
source_cols = df.columns
source_cols

Index(['AAA', 'BBB', 'CCC'], dtype='object')

In [35]:
new_cols = [str(x)+'_zz' for x in source_cols]
new_cols

['AAA_zz', 'BBB_zz', 'CCC_zz']

In [36]:
categories = {1 : 'Alpha', 2 : 'Beta', 3 : 'Charlie' }

In [37]:
df[new_cols] = df[source_cols].applymap(categories.get)
df

   AAA  BBB  CCC   AAA_zz BBB_zz   CCC_zz
0    1    1    2    Alpha  Alpha     Beta
1    2    1    1     Beta  Alpha    Alpha
2    1    2    3    Alpha   Beta  Charlie
3    3    2    1  Charlie   Beta    Alpha

### group_by

In [44]:
df = pd.DataFrame({'AAA' : [1,1,1,2,2,2,3,3], 'BBB' : [2,1,3,4,5,1,2,3],'CCC':[1,3,4,5,6,7,8,8]})
df

   AAA  BBB  CCC
0    1    2    1
1    1    1    3
2    1    3    4
3    2    4    5
4    2    5    6
5    2    1    7
6    3    2    8
7    3    3    8

In [45]:
df.loc[df.groupby('AAA')['BBB'].idxmin()]

   AAA  BBB  CCC
1    1    1    3
5    2    1    7
6    3    2    8

In [47]:
df.sort_values(by='BBB').groupby('AAA',as_index=False).first()

   AAA  BBB  CCC
0    1    1    3
1    2    1    7
2    3    2    8